Revit 2021.1 API
DocumentEntryPoint.Import Method
Overload List
Name | Description
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
 (Inherited from Document.)
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
 (Inherited from Document.)
Import(String, SKPImportOptions, View)
 Imports an SKP file into the document.
 (Inherited from Document.)
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
 (Inherited from Document.)
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace